Revit 2026 API

# MultistoryStairsGetStairsPlacementLevels Method

---

Gets all the levels the given stairs group placed on.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ISet<ElementId> GetStairsPlacementLevels(
	Stairs stairs
)
```
```vb
Public Function GetStairsPlacementLevels (
	stairs As Stairs
) As ISet(Of ElementId)
```
```cpp
public:
ISet<ElementId^>^ GetStairsPlacementLevels(
	Stairs^ stairs
)
```
```fsharp
member GetStairsPlacementLevels :
        stairs : Stairs -> ISet<ElementId>
```

#### Parameters

stairs Stairs
     A stairs element in this multistory stairs element.

#### Return Value

ISetElementId The ids of base levels of the given stairs in this multistory stairs.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input stairs is not a member of this multistory stairs. |
| ArgumentNullException | A non-optional argument was null |

If a stairs element is a stairs group, it gets all the base levels of each member of the group; If a stairs element is an individual stairs, it just gets the base level of the stairs element.

#### Reference

MultistoryStairs Class

Autodesk.Revit.DB.Architecture Namespace